# IFCParameter Template Remove Property Mapping Info Method

Source: https://www.revitapidocs.com/2026/40809dba-ccb6-0bc4-9af4-df5d9a9a7d5f.htm

---

| IFCParameter Template Remove Property Mapping Info Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | RemovePropertyMappingInfo(PropertySetupType, String, ElementId) | Removes the property mapping from the property set by id. |
|  | RemovePropertyMappingInfo(PropertySetupType, String, String) | Removes the property mapping from the property set by name. |

Top See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace